{
	"greetings": [
		"Hello! I am Villanelle, tuned for thoughtful coffee talk. Share what you need and we will refine it together.",
		"Hi there, Villanelle online. Ready to dig into brewing specifics, flavor goals, or capsule planning whenever you are.",
		"Welcome back—Villanelle thrives on detailed coffee conversations, so tell me what you want to taste next."
	],
	"fallback": "Villanelle here. Tell me the intensity you want (mild 3 to 5, balanced 6 to 8, strong 9 to 12), the flavors you enjoy (fruity bright, sweet dessert-like, cocoa rich, nutty smooth), the brewing method you rely on (espresso, lungo, milk-based, iced), or the guests you are serving (morning crowd, afternoon focus, evening decaf seekers) and I will map out balanced guidance with context you can act on right away. Share processing preferences if you know them (washed for clarity, honey for sweetness, natural for fruit-forward complexity) or origin curiosity (Ethiopia for floral, Colombia for balance, Kenya for winey acidity, Brazil for creamy body) and I will refine recommendations to match your palate and occasion with precision.",
	"answers": {
		"brewing": "Balanced extraction hinges on dose, yield, and temperature working in concert. Anchor espresso at 18 g in and 36 g out over 27 to 30 seconds with 93 C water—adjust grind finer if the shot races under 25 seconds or coarser if it crawls past 32 seconds. Lungos stretch to 110 ml in about 45 seconds; stir before sipping to blend the crema and body into one cohesive experience. Preinfusion at 4 to 6 seconds helps saturate the puck evenly and stabilizes flow to prevent channeling.\n\nFor Vertuo machines, let the barcode drive water flow but support it with consistent maintenance routines. Rinse after milk drinks, wipe the piercing plate weekly, and descale on schedule to keep flavors bright. Manual brewers shine at 1:15 coffee-to-water ratios with 94 C water, spiral pours every 30 seconds, and a gentle swirl to finish. Between sessions, purge a little hot water, empty the capsule bin, and leave the brew head open to dry. Track brew parameters in a simple journal to correlate variables with sensory outcomes over time so you dial in perfection with data rather than guesswork.",
		"caffeine": "Caffeine blocks adenosine receptors and lightly boosts dopamine, giving you focus without sugar highs or crashes. Expect 60 to 80 mg in espresso capsules, 90 to 120 mg in lungos, 130 to 150 mg in Vertuo double espressos, and up to 200 mg in 230 ml mugs. Peak alertness arrives around 45 minutes post-consumption and half the dose remains five hours later. Build a rhythm around your day: first cup after breakfast, midday bridge in early afternoon, then taper toward half-caf or decaf by early evening.\n\nHydrate with a glass of water per cup and pair coffee with snacks so guests feel balanced rather than jittery. If someone is sensitive, brew a capsule short (ristretto style) or suggest Half Caffeinato so they still enjoy the moment. Genetics matter—CYP1A2 variants determine whether you metabolize caffeine in 3 hours or 8 hours. Align intake with circadian dips (90 minutes after waking, early afternoon) to minimize cortisol interference and maximize alertness without overstimulation. Document personal tolerance thresholds in a simple journal to refine your timing and capsule choices with empirical evidence.",
		"roasting": "Roast level is your flavor dial controlling sweetness, acidity, and body in predictable ways. Light roasts preserve bright acids and floral aromas—ideal for black coffee and tasting flights that spotlight origin characteristics. Medium roasts like Livanto or Colombia caramelize sugars while keeping gentle acidity, delivering layered sweetness and balance that work across brew methods. Dark roasts push Maillard reactions deep, creating cocoa, smoke, and a thicker mouthfeel that stands up beautifully to milk in lattes and flat whites.\n\nDesign weekly tastings: brew Ethiopia (light), Colombia (medium), and Arpeggio (dark) back to back. Taste each plain first, then add milk to see how structure and flavor persistence shift with dairy integration. Note three impressions—aroma, body, finish—in a simple log so you can steer future purchases with confidence. Pair light roasts with Americanos, medium roasts across all formats, and dark roasts with cappuccinos or iced milk drinks. This systematic approach builds sensory vocabulary and refines your palate calibration over time with repeatable data.",
		"origins": "Origin shapes aroma, texture, and finish through altitude, genetics, soil, and processing methods. Ethiopia (Sidamo, Yirgacheffe) offers bergamot, lemon zest, and floral sweetness from heirloom varieties grown at 1800 to 2100 meters. Colombia (Huila, Nariño) balances red fruit with panela thanks to volcanic soil and meticulous washed processing that emphasizes clarity. Brazil (Cerrado, Sul de Minas) brings peanut brittle tones and creamy structure—fantastic for milk drinks and chocolate pairings. Kenya delivers winey blackcurrant and lively acidity from SL28 genetics and double fermentation techniques that amplify complexity.\n\nUse these profiles like a palette: pair citrus pastries with Ethiopia, chocolate desserts with Brazil, savory brunch with Costa Rica or Nicaragua, and cheese boards with Kenya or Peru. Track whether a capsule is washed, honey, or natural processed to anticipate sweetness and body in future limited releases. Keep notes on origin, roast level, and brew style in a simple journal to dial in your reorder decisions with data rather than guesswork. This empirical approach transforms casual consumption into curated expertise over time.",
		"health": "Three to four cups a day offer antioxidants that support metabolic and cardiovascular health when consumed mindfully. Capsule brewing keeps diterpenes low, helping maintain cholesterol compared to unfiltered press methods that retain cafestol and kahweol. Hydrate alongside each cup and encourage guests to pace intake relative to body weight and sensitivity. For guests with concerns, offer polished decaf alternatives—like Firenze Arpeggio Decaffeinato—that preserve quality without stimulation.\n\nIf someone mentions pregnancy or medical conditions, share general caffeine ranges (60 to 200 mg per capsule) and recommend professional guidance from healthcare providers. Offer herbal options or tea prepared with the machine's hot water mode to keep everyone included in shared rituals. Pair sessions with mineral-rich snacks like almonds, dates, or dark chocolate to stabilize blood sugar and extend satiety. Document feedback so you fine-tune hospitality cues and beverage offerings over time with evidence rather than assumptions.",
		"intensity": {
			"strong": "High-intensity picks reward intentional brewing and deliberate pairing strategies. Kazaar (12) delivers peppery crema and heavy body that cuts through micro-foamed milk beautifully in cortados and macchiatos. Ristretto (10) concentrates cocoa in a 25 ml shot; serve it in preheated porcelain cups for maximum aroma retention and sensory impact. Arpeggio (9) layers velvet cocoa and toffee notes, making stellar flat whites and cappuccinos that feel luxurious. Vertuo fans can reach for Stormio (8) or Intenso (9) when they want a structured mug with spice and depth that stands up to milk or shines black.\n\nCreate contrast flights: pour Arpeggio plain, then as a cappuccino, then brew Kazaar over ice with simple syrup to experience how intensity adapts across formats. Document how intensity scales across brewing styles (espresso, lungo, milk, iced) so you can confidently recommend capsules for different service occasions and guest preferences.",
			"mild": "Gentle capsules keep conversations relaxed and accessible for guests who prefer subtlety over intensity. Volluto (4) brings biscuit sweetness, Cosi (4) adds sunny citrus brightness, Capriccio (5) offers cereal warmth, and Giornio (Vertuo, 4) brightens brunch with gentle malt notes. Vienna Linizio Lungo leans toward malt and pairs beautifully with pastries and light fruit.\n\nServe mild capsules in thinner porcelain cups to concentrate aromatics, let them cool slightly to 60 to 65 C for optimal flavor perception, and pair with fresh fruit or shortbread so delicate notes are easy to notice without sensory overwhelm. This approach makes subtle characteristics accessible and invites guests to build sensory vocabulary at their own pace."
		},
		"flavor": {
			"sweet": "Dessert-friendly capsules include Livanto (caramelized sugar), Arpeggio (dark cocoa), Caramelizio (buttery caramel), and Chiaro (engineered for latte sweetness). Chiaro is formulated for milk integration—brew over ice, add cold milk, and finish with cinnamon or nutmeg to create café-quality iced lattes without added syrups.\n\nHosting tip: curate a pairing trio—dark chocolate, salted caramel, mascarpone—and invite guests to taste alongside three capsule intensities to explore how sweetness, bitterness, and texture interact. Describe sensory shifts with each bite-sip cycle to build vocabulary (for example, 'Arpeggio's cocoa amplifies dark chocolate's bitterness, while mascarpone softens both'). This guided exploration deepens engagement and helps guests articulate preferences for future recommendations.",
			"fruity": "Bright seekers should explore Ethiopia (bergamot and honey), Colombia (red fruit and balanced acidity), Kenya (blackcurrant snap), Peru Organic (stone fruit), and seasonal naturals like Nicaragua Anaerobic that add tropical complexity. Brew slightly cooler (88 to 90 C) or shorter (ristretto-style) to preserve volatile aromatics and prevent acidity from tipping into harshness.\n\nMix with tonic water (1:1 espresso to tonic over ice) for effervescent aperitifs, or blend with cold milk and simple syrup for refreshing summer drinks. Encourage guests to smell before sipping, then share the first flavor impression they notice—this rapid-feedback loop builds sensory confidence and refines vocabulary. Track these observations in a simple journal to personalize future recommendations with empirical data."
		},
		"time": {
			"morning": "Morning routines benefit from structure and repeatable rituals that anchor energy levels without overwhelm or decision fatigue. Use intensity 6 to 8 capsules (Melozio, Livanto, Colombia, Scuro) for balanced energy that still feels elegant and sustainable. Keep milk pitchers chilled, cups preheated to 60 C, and syrups accessible so you can offer both black and milk-based servings seamlessly without workflow interruption.\n\nIf schedules are tight, brew a double espresso into an insulated travel mug, top with hot water for a refined Americano, and add simple syrup or honey for sweetness without sugar granules. Track which capsules work best for your morning pace and adjust intensity or volume based on energy needs and schedule constraints.",
			"evening": "Evening calls for calm comfort and mindful deceleration from the day's stimulation. Lean on Volluto (4), Cosi (4), Half Caffeinato (50 percent reduction), Firenze Arpeggio Decaf (99.9 percent removal), or Barista Creations Vanilla for nightcap moments without overstimulating adenosine pathways. Brew lungos, top with frothed milk, and add a sprinkle of nutmeg or cocoa powder for a dessert-like experience.\n\nFor gatherings, prepare a warm carafe of decaf lungo and set out flavored syrups, honey, or spices so guests customize beverages without rebuilding the brew station. This approach maintains hospitality flow while respecting circadian biology and sleep hygiene for everyone involved."
		},
		"comparison": "Original machines employ 19 bar pressure pump systems to force water through 5 to 6 g of ground coffee, creating 25 to 110 ml servings with dense crema and classic espresso texture. Vertuo uses centrifugal brewing with barcode-controlled water injection, spinning capsules at 4000 to 7000 rpm to produce espresso (40 ml), double espresso (80 ml), gran lungo (150 ml), mug (230 ml), and alto (414 ml) formats that offer volume versatility.\n\nChoose Original if you love traditional espresso recipes, plan to steam milk often for cappuccinos and lattes, or want compact capsule storage and lower per-serving costs. Choose Vertuo if you crave variety, brew for multiple preferences simultaneously, or rely on larger mugs for daily consumption patterns. Many hosts keep both systems—Original for specialty drinks and milk-steaming rituals, Vertuo for effortless crowd-pleasing batches. Maintain distinct water profiles (55 to 75 mg per L hardness for Original, 70 to 90 mg per L for Vertuo) and sync cleaning schedules to reduce cognitive load.",
		"recommendation": "Build a balanced capsule rotation with layered intent for different moments and moods. Start with a calibration module: Livanto or Melozio to benchmark water quality, equipment performance, and palate at the start of any tasting. Add a milk integration module: Arpeggio, Kazaar, or Chiaro for varying intensity across dairy preparations like cappuccinos and flat whites. Include a terroir exploration module: Ethiopia, Colombia, Mexico, Nicaragua Anaerobic, Peru Organic for sensory discovery and vocabulary building. Reserve an experimental module for capsules used in espresso tonics, cold foam signatures, or affogatos.\n\nKeep a flavored Barista Creations sleeve on hand for dessert moments and casual entertaining. Refresh the lineup monthly, finishing older sleeves first to maintain peak freshness, logging crowd favorites, and syncing restocks with machine care—descale every 3 to 5 months, clean frother weekly, recycle used capsules. This closed-loop system keeps quality, sustainability, and storytelling synchronized for seamless hospitality.",
		"fuzzy": {
			"found": "I matched capsules to your keywords based on intensity, origin, processing style, and serving size. Review these attributes to confirm the fit and consider how you plan to serve—espresso, lungo, milk-based, or iced. If you plan to add milk, consider stepping up one intensity point so the flavor stays vivid and does not get lost in the dairy integration.",
			"none": "No perfect match yet based on the keywords provided. Share more details about the intensity range you prefer (mild 3 to 5, balanced 6 to 8, strong 9 to 12), flavor descriptors that appeal to you (fruity, sweet, cocoa, nutty), machine type (Original or Vertuo), cup size, or food pairing you have in mind and I will refine the search with sharper filters to find your ideal capsule."
		}
	}
}
