{
	"greetings": [
		"Hi! I am Tanka, your quick coffee wingman. Toss me a short question and I will guide you toward a tasty cup in no time.",
		"Hello there, Tanka ready to steer you through capsules, flavors, and brewing basics without any fuss.",
		"Hey! You can count on Tanka for instant coffee clarity—just tell me what you are craving."
	],
	"fallback": "I am Tanka, built for fast coffee pointers. Mention intensity, flavors, time of day, capsule types, or machine questions and I will keep the answer focused, friendly, and practical.",
	"answers": {
		"brewing": "Great coffee is mostly about repeatable habits. Start with fresh capsules, rinse the machine for a few seconds, and preheat your cup so the crema stays silky. Keep your water clean—filtration or bottled water between 90 and 96 C protects flavor and protects the machine from scale.\n\nWatch the timer as a guide: Original espresso should land around 25 seconds for 40 ml, while a lungo stretches to roughly 40 seconds for 110 ml. If the pour is racing, descale or run a cleaning cycle. If it drips too slowly, eject the capsule and give the brew head a quick wipe before trying again. Add a gentle stir at the end for bigger cups to keep the layers tasting balanced.",
		"caffeine": "Caffeine blocks adenosine receptors, so you feel alert instead of sleepy. A standard espresso capsule delivers about 60 to 80 mg, lungos climb near 110 mg, and Vertuo mug capsules can climb above 160 mg. You feel the lift in 30 to 45 minutes, the strongest effects last about 3 hours, and then it tapers off.\n\nIf you are sensitive, switch to Half Caffeinato after lunch, brew shorter (ristretto style) for less volume, or stretch the shot with milk or water to make it feel gentler. Keep water nearby and pause after three cups so you do not edge into jitters or late-night staring at the ceiling.",
		"roasting": "Roast level changes sweetness and body in a predictable way. Light roasts taste bright and fruity because they keep more natural acids, medium roasts ride the line with caramel and toasted cereal notes, and dark roasts feel smoky, bittersweet, and bold. Capsules like Ethiopia stay lighter with floral sparkle, while Kazaar pushes deep and dark when you want syrupy strength.\n\nIf you drink with milk, pick medium or dark roasts so the flavor still shines through. For iced drinks, brew intense capsules directly over ice to keep them from tasting watered down. Rotate between roast levels during the week so you notice the differences and avoid palate fatigue.",
		"origins": "Coffee from different origins carries different personality. Ethiopia brings jasmine, citrus, and stone-fruit vibes, Colombia keeps things balanced with red fruit and caramel, Brazil leans toward roasted nuts and chocolate, while India or Nicaragua can feel spicy and molasses-like. Even the same capsule can taste different with or without milk.\n\nTry a mini flight: brew three espresso shots back to back, sip each plain, then dilute each with a spoon of milk to see how the character shifts. Jot down quick notes like fruity, chocolate, or cereal so you remember what to restock.",
		"health": "Most people handle three to four cups a day without trouble, especially when they hydrate alongside each coffee. Coffee brings antioxidants and a mood lift, but it can also raise heart rate or disturb sleep if you push too far. Listen to your body: slow down if you feel anxious, switch to decaf in the evening, and keep snacks nearby to avoid a caffeine-only energy spike.\n\nRemember basic care: wipe the milk frother after each use, descale every few months, and recycle used capsules through the Nespresso program or a local drop-off so your ritual stays environmentally friendly.",
		"intensity": {
			"strong": "Looking for power? Start with Kazaar (intensity 12) for peppery strength, Ristretto (10) for a short punch of cocoa, or Arpeggio (9) for smooth chocolate depth. For Vertuo gear, try Stormio or Intenso when you want a bold mug that still tastes great with milk.\n\nIf you want even more kick, brew a capsule twice using less water or stack two different intense capsules (Arpeggio then Ristretto) for a layered morning blend.",
			"mild": "Prefer gentle? Volluto (4) and Cosi (4) stay light and sweet, Capriccio (5) offers cereal softness with a little crema, and Melozio (6) gives a buttery mug that fits breakfast perfectly.\n\nTo keep the flavor delicate, preheat the cup but let the drink cool a touch before sipping. Add a splash of oat or almond milk for extra smoothness without burying the flavor."
		},
		"flavor": {
			"sweet": "For sweet cups reach for Livanto, Arpeggio, or Caramelizio—each one leans toward caramel, cocoa, and dessert-like notes that pair well with milk or a square of chocolate on the side. Barista Creations Chiaro is built to taste like a caramel latte when you add steamed milk.\n\nBoost sweetness by lowering brew volume by 5 to 10 ml, stirring in a teaspoon of condensed milk, or serving over ice with vanilla syrup for a simple afternoon treat.",
			"fruity": "Want fruit? Ethiopia, Colombia, and limited editions like Peru Organic give you citrus, berry, and floral hints without heavy roast bitterness. Master Origin Costa Rica adds honey sweetness with a bright finish, while Ethiopia brewed as a lungo brings out bergamot.\n\nTo highlight the fruit, sip it plain before adding milk, or brew over sparkling water with a squeeze of orange peel for a refreshing spritz."
		},
		"time": {
			"morning": "Start the day with Livanto or Melozio around intensity 6 to 7 so you wake up without overwhelming your palate. If mornings feel hectic, preset cups the night before, fill the water tank, and stack your favorite capsules in order. Add a pinch of cinnamon or cocoa powder to the cup before brewing for a mini ritual that feels special.\n\nYou can also brew a lungo and split it into two smaller cups—one for now, one for a quick later pick-me-up—so you are not brewing twice.",
			"evening": "For evenings choose Volluto, Half Caffeinato, Vienna Linizio Lungo, or decaf blends so you keep the ritual but dodge a late-night caffeine buzz. Brew into a larger mug and top with frothed milk or a dusting of nutmeg to make it feel like dessert.\n\nIf you still want warmth without caffeine, run a hot water cycle through the machine and steep a tea bag afterward—no need to leave the coffee corner to unwind."
		},
		"comparison": "Original machines work with high pressure for classic espresso sizes, delivering rich crema in small cups. Vertuo spins capsules to brew everything from short espresso to 230 ml mugs, automatically adjusting water volume with capsule barcodes. If you mainly drink milk drinks, Original keeps things simple and compact. If your household wants larger mugs or shares the machine, Vertuo handles variety without extra steps.\n\nSome people keep both: Original for weekend cappuccinos, Vertuo for weekday travel mugs. If you are choosing your first machine, think about the cup sizes you reach for most and how often you host guests.",
		"recommendation": "Popular everyday picks include Livanto for balance, Arpeggio when you crave chocolate depth, Volluto for light sweetness, and Ethiopia for a brighter treat. For variety, mix in a seasonal limited edition or a flavored Barista Creations capsule each month.\n\nKeep a small capsule organizer labeled by intensity or flavor so you can grab what matches your mood. Note the winners on your phone so reordering feels effortless.",
		"fuzzy": {
			"found": "I spotted capsules that match your keywords. Check their intensity number, serving size, and tasting notes to confirm the fit. If you like a bit of milk, lean one step higher on the intensity scale so the flavor stays present.",
			"none": "I could not map that request yet. Mention intensity, flavors, machine type, or whether you want hot, iced, or milk drinks and I will narrow things down with new suggestions."
		}
	}
}
